package com.xuge.sampletest.gson;

public class Constants {

    // https://www.jianshu.com/p/331f0bf161c2
    public static String book = "{\n" +
            "rating: {\n" +
            "max: 10,\n" +
            "numRaters: 280884,\n" +
            "average: \"9.0\",\n" +
            "min: 0\n" +
            "},\n" +
            "subtitle: \"\",\n" +
            "author: [\n" +
            "\"[法] 圣埃克苏佩里\"\n" +
            "],\n" +
            "pubdate: \"2003-8\",\n" +
            "tags: [\n" +
            "{\n" +
            "count: 62445,\n" +
            "name: \"小王子\",\n" +
            "title: \"小王子\"\n" +
            "},\n" +
            "{\n" +
            "count: 52968,\n" +
            "name: \"童话\",\n" +
            "title: \"童话\"\n" +
            "},\n" +
            "{\n" +
            "count: 25860,\n" +
            "name: \"经典\",\n" +
            "title: \"经典\"\n" +
            "},\n" +
            "{\n" +
            "count: 25426,\n" +
            "name: \"圣埃克苏佩里\",\n" +
            "title: \"圣埃克苏佩里\"\n" +
            "},\n" +
            "{\n" +
            "count: 22685,\n" +
            "name: \"法国\",\n" +
            "title: \"法国\"\n" +
            "},\n" +
            "{\n" +
            "count: 19404,\n" +
            "name: \"外国文学\",\n" +
            "title: \"外国文学\"\n" +
            "},\n" +
            "{\n" +
            "count: 15313,\n" +
            "name: \"哲学\",\n" +
            "title: \"哲学\"\n" +
            "},\n" +
            "{\n" +
            "count: 11004,\n" +
            "name: \"小说\",\n" +
            "title: \"小说\"\n" +
            "}\n" +
            "],\n" +
            "origin_title: \"Le Petit Prince\",\n" +
            "image: \"https://img3.doubanio.com/view/subject/m/public/s1103152.jpg\",\n" +
            "binding: \"平装\",\n" +
            "translator: [\n" +
            "\"马振聘\"\n" +
            "],\n" +
            "catalog: \"第一卷 南渡记出版说明人物表序曲第一章 第二章第三章第四章第五章第六章第七章间曲后记第二卷 东藏记人物表……间曲后记 \",\n" +
            "pages: \"97\",\n" +
            "images: {\n" +
            "small: \"https://img3.doubanio.com/view/subject/s/public/s1103152.jpg\",\n" +
            "large: \"https://img3.doubanio.com/view/subject/l/public/s1103152.jpg\",\n" +
            "medium: \"https://img3.doubanio.com/view/subject/m/public/s1103152.jpg\"\n" +
            "},\n" +
            "alt: \"https://book.douban.com/subject/1084336/\",\n" +
            "id: \"1084336\",\n" +
            "publisher: \"人民文学出版社\",\n" +
            "isbn10: \"702004249X\",\n" +
            "isbn13: \"9787020042494\",\n" +
            "title: \"小王子\",\n" +
            "url: \"https://api.douban.com/v2/book/1084336\",\n" +
            "alt_title: \"Le Petit Prince\",\n" +
            "author_intro: \"安托万·德·圣埃克苏佩里（Antoine de Saint-Exupery, 1900-1944）1900年6月29日出生在法国里昂。他曾经有志于报考海军学院，未能如愿，却有幸成了空军的一员。1923年退役后，先后从事过各种不同的职业。 1926年，圣埃克苏佩里进入拉泰科埃尔航空公司。在此期间，出版小说《南方邮件》（1929）、《夜航》（1931），从此他在文学上声誉鹊起。1939年，又一部作品《人的大地》问世。 第二次世界大战期间他重入法国空军。后辗转去纽约开始流亡生活。在这期间，写出《空军飞行员》、《给一个人质的信》、《小王子》（1943）等作品。1944年返回同盟国地中海空军部队。在当年7月31日的一次飞行任务中，他驾驶飞机飞上湛蓝的天空，就此再也没有回来。\",\n" +
            "summary: \"小王子是一个超凡脱俗的仙童，他住在一颗只比他大一丁点儿的小行星上。陪伴他的是一朵他非常喜爱的小玫瑰花。但玫瑰花的虚荣心伤害了小王子对她的感情。小王子告别小行星，开始了遨游太空的旅行。他先后访问了六个行星，各种见闻使他陷入忧伤，他感到大人们荒唐可笑、太不正常。只有在其中一个点灯人的星球上，小王子才找到一个可以作为朋友的人。但点灯人的天地又十分狭小，除了点灯人他自己，不能容下第二个人。在地理学家的指点下，孤单的小王子来到人类居住的地球。 小王子发现人类缺乏想象力，只知像鹦鹉那样重复别人讲过的话。小王子这时越来越思念自己星球上的那枝小玫瑰。后来，小王子遇到一只小狐狸，小王子用耐心征服了小狐狸，与它结成了亲密的朋友。小狐狸把自己心中的秘密——肉眼看不见事务的本质，只有用心灵才能洞察一切——作为礼物，送给小王子。用这个秘密，小王子在撒哈拉大沙漠与遇险的飞行员一起找到了生命的泉水。最后，小王子在蛇的帮助下离开地球，重新回到他的B612号小行星上。 童话描写小王子没有被成人那骗人的世界所征服，而最终找到自己的理想。这理想就是连结宇宙万物的爱，而这种爱又是世间所缺少的。因此，小王子常常流露出一种伤感的情绪。作者圣埃克絮佩里在献辞中说：这本书是献给长成了大人的从前那个孩子。 《小王子》不仅赢得了儿童读者，也为成年人所喜爱，作品凝练的语言渗透了作者对人类及人类文明深邃的思索。它所表现出的讽刺与幻想，真情与哲理，使之成为法国乃至世界上最为著名的一部童话小说。\",\n" +
            "price: \"22.00元\"\n" +
            "}";

    public static String news = "{\n" +
            "showapi_res_code: 0,\n" +
            "showapi_res_error: \"\",\n" +
            "showapi_res_body: {\n" +
            "pagebean: {\n" +
            "allNum: 577,\n" +
            "allPages: 29,\n" +
            "contentlist: [\n" +
            "{\n" +
            "channelId: \"5572a108b3cdc86cf39001cd\",\n" +
            "channelName: \"国内焦点\",\n" +
            "desc: \" 　　中国警察网北京4月22日电中国共产党的优秀党员，公安部原部长、党委书记陶驷驹同志，因病医治无效，于2016年4月18日0时36分在北京逝世， 享年81岁。22日上午，陶驷驹同志遗体送别仪式在北京举行。　　习近平、李克强、刘云山、张高丽、刘延东、李源潮、孟建柱、赵乐际、胡锦....\",\n" +
            "imageurls: [\n" +
            "{\n" +
            "height: 480,\n" +
            "url: \"http://n.sinaimg.cn/news/transform/20160423/P7Jb-fxrqhar9853560.jpg\",\n" +
            "width: 400\n" +
            "}\n" +
            "],\n" +
            "link: \"http://news.sina.com.cn/c/nd/2016-04-23/doc-ifxrpvea1126476.shtml\",\n" +
            "pubDate: \"2016-04-23 10:16:54\",\n" +
            "source: \"新浪\",\n" +
            "title: \"公安部原部长陶驷驹逝世 习近平胡锦涛等送花圈\"\n" +
            "},\n" +
            "{\n" +
            "channelId: \"5572a108b3cdc86cf39001cd\",\n" +
            "channelName: \"国内焦点\",\n" +
            "desc: \" 　　原标题：山东3县市购房补钱！继邹城、寿光后，即墨也加入资料图　　日前，即墨市制定《关于促进房地产市场持续健康平稳发展的实施意见》，即墨市财政 将对购房者予以补贴。从《意见》出台之日起到今年年底前，在即墨首次购新建商品房的市民，每平米可领取补贴50到200元。对购....\",\n" +
            "imageurls: [\n" +
            "{\n" +
            "height: 327,\n" +
            "url: \"http://ww4.sinaimg.cn/mw690/77de9208jw1f36aamk03mj20go093406.jpg\",\n" +
            "width: 600\n" +
            "}\n" +
            "],\n" +
            "link: \"http://news.sina.com.cn/c/nd/2016-04-23/doc-ifxrpvea1122744.shtml\",\n" +
            "pubDate: \"2016-04-23 07:52:13\",\n" +
            "source: \"新浪\",\n" +
            "title: \"山东3县市对购房者予以财政补贴\"\n" +
            "},\n" +
            "{\n" +
            "channelId: \"5572a108b3cdc86cf39001cd\",\n" +
            "channelName: \"国内焦点\",\n" +
            "desc: \" 　　原标题：首家商业火箭公司成立　　京华时报讯（记者潘珊菊）昨天下午，记者从航天科工集团获悉，在成功发射首颗卫星“东方红一号”46年后，中国航天 技术步入“商用时代”，我国首家商业模式开展研发和应用的专业化火箭公司已于今年2月16日在武汉注册成立。　　据介绍，该公....\",\n" +
            "imageurls: [ ],\n" +
            "link: \"http://news.sina.com.cn/o/2016-04-23/doc-ifxrpvqz6479220.shtml\",\n" +
            "pubDate: \"2016-04-23 03:19:35\",\n" +
            "source: \"新浪\",\n" +
            "title: \"中国首家商业火箭公司成立 注册时曾引官方争议\"\n" +
            "}\n" +
            "],\n" +
            "currentPage: 1,\n" +
            "maxResult: 20\n" +
            "},\n" +
            "ret_code: 0\n" +
            "}\n" +
            "}";
}
